//======================================================================
//文件名称：adc.h
//功能概要：ADC底层驱动构件头文件
//芯片类型：STM32F103C8T6
//版权所有：江苏电子-索明何
//版本更新：2023-01-29  V1.0
//======================================================================
#ifndef  _ADC_H              //防止重复定义（开头）
#define  _ADC_H

//1.头文件包含
#include  "common.h"         //包含公共要素软件构件头文件

//2.宏定义
//(1)ADC号宏定义
#define  ADC_1    0
#define  ADC_2    1

//3.对外接口函数声明
//======================================================================
//函数名称：adc_init
//函数功能：对指定的ADC进行初始化（只对1个常规通道进行1次转换）
//函数参数：ADCx: ADC号（可用宏定义ADC_1或ADC_2作为函数实参）
//函数返回：无
//相关说明：ADC时钟频率为8MHz
//函数调用示例：
//   adc_init(ADC_2);         //对ADC2模块进行初始化  
//======================================================================
void adc_init(uint8 ADCx);

//======================================================================
//函数名称：adc_get
//函数功能：对指定的ADC及其常规通道进行一次采样，获取A/D转换结果
//函数参数：ADCx:   ADC号（可用宏定义ADC_1或ADC_2作为函数实参）
//          adc_ch: ADC通道号（0~9分别对应外部输入通道ADC_IN0~ADC_IN9）
//函数返回：A/D转换结果
//相关说明：芯片ADC外部输入通道对应的引脚：
//   ADC_IN0~ADC_IN7分别对应PTA0~PTA7，ADC_IN8、ADC_IN9分别对应PTB0、PTB1
//函数调用示例：
//     adc_get(ADC_2, 3);      //获取ADC2通道3的A/D转换值  
//======================================================================
uint16 adc_get(uint8 ADCx, uint8 adc_ch);

#endif                 //防止重复定义（结尾）
