//======================================================================
//文件名称：can.h
//功能概要：CAN底层驱动构件头文件
//芯片类型：STM32F103C8T6
//版权所有：江苏电子-索明何
//版本更新：2023-03-01  V1.0
//======================================================================
#ifndef  _CAN_H            //防止重复定义（开头）
#define  _CAN_H

//1.头文件包含
#include  "common.h"       //包含公共要素软件构件头文件

//2.宏定义
//CAN使用的引脚宏定义（由具体硬件板决定）
#define  CAN1_GROUP   2    //1表示PTA11-CAN_RX、PTA12-CAN_TX
                           //2表示PTB8-CAN_RX、 PTB9-CAN_TX

//3.CAN通信的数据包结构体声明
typedef struct
{
    uint32  ID;            //帧ID
    uint8   IDE;           //标准格式帧为0，扩展格式帧为1
    uint8   RTR;           //数据帧为0，远程帧为1
    uint8   DataLen;       //帧数据长度（0~8）
    uint8   data[8];       //帧数据
} CAN_Msg;

//4.对外接口函数声明
//======================================================================
//函数名称：can_init
//函数功能：CAN模块初始化
//函数参数：BaudRate:  波特率，建议使用5、10、15、...、1000（kbit/s）
//          RecvID:    预想接收的帧ID
//                     标准帧11位ID值为0~0x7FF，且高7位不能同时为1
//                     扩展帧29位ID值为0~0x1FFFFFFF，且高7位不能同时为1
//          FilterMask: 过滤器掩码值，1表示有关，0表示无关
//                      标准帧对应的11位掩码值为0~0x7FF
//                      扩展帧对应的29位掩码值为0~0x1FFFFFFF
//函数返回：无
//相关说明：
//  (1)当掩码寄存器的某位设置为“有关”时，该位对应的传入标识符位值（0、1）与标识符
//     寄存器位值（0、1）一致时，本节点才接收；若两个位值不一致，则本节点放弃接收。
//     当掩码寄存器的某位设置为“无关”时，该位对应的传入标识符位值不论是0还是1，
//     本节点均接收
//  (2)所有CAN节点使用相同的波特率，才能正常通信
//函数调用示例：
//   CAN模块初始化，波特率为200kbit/s，预想接收的帧ID为0x123，过滤器掩码值为0x7FF
//   can_init(200, 0x123, 0x7FF); 
//======================================================================
void can_init(uint16 BandRate, uint32 RecvID, uint32 FilterMask);

//======================================================================
//函数名称：can_send
//函数功能：发送一帧CAN报文（数据帧或远程请求帧）
//函数参数：*SendMsg: 用于指向待发送CAN数据包结构体的首地址
//函数返回：1表示发送成功，0表示发送失败
//函数调用示例：
//   发送一帧CAN报文，其中待发送的CAN数据包保存在结构体变量send_msg中
//    can_send(&send_msg); 
//======================================================================
uint8 can_send(CAN_Msg *SendMsg);

//======================================================================
//函数名称：can_recv
//函数功能：接收一帧CAN报文（数据帧或远程请求帧）
//函数参数：*RecvMsg: 用于指向接收CAN数据包的结构体首地址
//函数返回：1表示成功接收一帧报文，0表示未接收到报文
//函数调用示例：
//   接收一帧CAN报文，并将收到的CAN数据包保存至结构体变量recv_msg中
//    can_recv(&recv_msg);        
//======================================================================
uint8 can_recv(CAN_Msg *RecvMsg);

//======================================================================
//函数名称：can_recv_int_enable
//函数功能：使能CAN接收中断
//函数参数：无
//函数返回：无
//======================================================================
void can_recv_int_enable(void);

//======================================================================
//函数名称：can_recv_int_disable
//函数功能：禁止CAN接收中断
//函数参数：无
//函数返回：无
//======================================================================
void can_recv_int_disable(void);

#endif            //防止重复定义（结尾）
