//======================================================================
//文件名称：systick.h
//功能概要：SysTick定时器底层驱动构件头文件
//芯片类型：STM32F103C8T6
//版权所有：江苏电子-索明何
//版本更新：2023-01-25  V1.0
//======================================================================
#ifndef  _SYSTICK_H       //防止重复定义（开头）
#define  _SYSTICK_H

//1.头文件包含
#include  "common.h"       //包含公共要素软件构件头文件

//2. 对外接口函数声明
//======================================================================
//函数名称：systick_init
//函数功能：初始化SysTick定时器（使用内核时钟频率），设置定时中断的时间间隔
//函数参数：int_ms: 定时中断的时间间隔，合理范围为1~262ms
//函数返回：无
//相关说明：int_ms = 滴答数ticks /内核时钟频率，其中ticks范围为1~2^24。
//          当内核时钟源频率=64000kHz时，int_ms的合理范围为1~262ms。
//函数调用示例：
//   systick_init(50);         //初始化SysTick定时器，定时50ms
//======================================================================
void systick_init(uint16 int_ms);

#endif                  //防止重复定义（结尾）
