//========================================================================
//文件名称：timer.h
//功能概要：Timer基本定时底层驱动构件头文件
//芯片类型：STM32F103C8T6
//版权所有：江苏电子-索明何
//版本更新：2023-01-23  V1.0
//========================================================================
#ifndef  _TIMER_H         //防止重复定义（开头）
#define  _TIMER_H

//1.头文件包含
#include  "common.h"      //包含公共要素软件构件头文件

//2.宏定义
//(1)TIMER号宏定义
#define  TIMER1   0
#define  TIMER2   1
#define  TIMER3   2
#define  TIMER4   3

//(2)TIMER时钟频率（对时钟源频率64MHz进行64分频获得）
#define  TIMER_CLK_MHZ    1        //1MHz
#define  TIMER_CLK_KHZ    1000     //1000kHz

//3.对外接口函数声明
//========================================================================
//函数名称：timer_init
//函数功能：对指定的Timer进行基本定时功能初始化
//函数参数：TIMERx:  TIMER号（可用宏定义TIMER1~TIMER4之一作为函数实参）
//          time_us: 定时时间，范围为1~65536 us
//函数返回：无
//相关说明：当Timer计数时钟频率为1MHz时，Timer的计数时钟周期为1us。
//          对于16位Timer，计数值为1~65536，因此定时时间为1~65536us。
//函数调用示例：
//   timer_init(TIMER2, 2000);     //初始化定时器TIMER2，定时2000us（2ms）
//========================================================================
void timer_init(uint8 TIMERx, uint32 time_us);

//========================================================================
//函数名称：timer_update_int_enable
//函数功能：使能指定TIMER的更新中断
//函数参数：TIMERx: TIMER号（可用宏定义TIMER1~TIMER4之一作为函数实参） 
//函数返回：无
//相关说明：当计数器溢出时，计数器的值更新，并生成更新事件，更新标志UIF由硬件置1。
//          若使能TIMER中断和更新中断，则当UIF=1时，产生定时器更新中断。     
//函数调用示例：
//   timer_update_int_enable(TIMER2);     //使能定时器TIMER2更新中断           
//========================================================================
void timer_update_int_enable(uint8 TIMERx);

//========================================================================
//函数名称：timer_update_int_disable
//函数功能：禁止指定TIMER的更新中断
//函数参数：TIMERx: TIMER号（可用宏定义TIMER1~TIMER4之一作为函数实参）
//函数返回：无
//函数调用示例：
//   timer_update_int_disable(TIMER2);    //禁止定时器TIMER2更新中断   
//========================================================================
void timer_update_int_disable(uint8 TIMERx);

//========================================================================
//函数名称：timer_uif_get
//函数功能：获取指定TIMER的更新标志
//函数参数：TIMERx: TIMER号（可用宏定义TIMER1~TIMER4之一作为函数实参）  
//函数返回：1表示计数器有更新，0表示计数器无更新
//函数调用示例：
//    timer_uif_get(TIMER2);              //获取定时器TIMER2的更新标志   
//========================================================================
uint8 timer_uif_get(uint8 TIMERx);

//========================================================================
//函数名称：timer_uif_clear
//函数功能：清除指定TIMER的更新标志
//函数参数：TIMERx: TIMER号（可用宏定义TIMER1~TIMER4之一作为函数实参） 
//函数返回：无
//函数调用示例：
//   timer_uif_clear(TIMER2);            //清除定时器TIMER2的更新标志   
//========================================================================
void timer_uif_clear(uint8 TIMERx);

#endif                 //防止重复定义（结尾）
